; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph0 - mode
	spectrograph4 - mode
	image3 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Planet23 - direction
	Planet24 - direction
	Planet25 - direction
	Star26 - direction
	Star27 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon15)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star19)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image3)
	(supports instrument7 spectrograph4)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument8 image3)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 thermograph2)
	(supports instrument10 image1)
	(supports instrument10 image3)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet11)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite3 Planet21)
	(have_image Star5 image1)
	(have_image Planet6 spectrograph4)
	(have_image Star8 thermograph0)
	(have_image Planet9 spectrograph4)
	(have_image Star10 spectrograph4)
	(have_image Planet11 spectrograph4)
	(have_image Phenomenon12 image3)
	(have_image Phenomenon13 image3)
	(have_image Planet14 thermograph0)
	(have_image Phenomenon15 thermograph0)
	(have_image Planet17 thermograph2)
	(have_image Star18 spectrograph4)
	(have_image Star19 image3)
	(have_image Planet20 thermograph0)
	(have_image Planet21 image3)
	(have_image Planet22 spectrograph4)
	(have_image Planet23 thermograph0)
	(have_image Planet24 image1)
	(have_image Planet25 image3)
	(have_image Star26 thermograph0)
	(have_image Star27 thermograph0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 23
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 23
3. (turn_to satellite4 groundstation4 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 23
4. (calibrate satellite4 instrument10 groundstation4)
   added: (calibrated instrument10)
   goals met: 0 of 23
5. (turn_to satellite4 phenomenon12 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 23
6. (take_image satellite4 phenomenon12 instrument10 image3)
   added: (have_image phenomenon12 image3)
   goals met: 1 of 23
7. (turn_to satellite4 phenomenon13 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon13)
   goals met: 1 of 23
8. (take_image satellite4 phenomenon13 instrument10 image3)
   added: (have_image phenomenon13 image3)
   goals met: 2 of 23
9. (turn_to satellite4 planet17 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 planet17)
   goals met: 2 of 23
10. (take_image satellite4 planet17 instrument10 thermograph2)
   added: (have_image planet17 thermograph2)
   goals met: 3 of 23
11. (turn_to satellite4 planet21 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet21)
   goals met: 3 of 23
12. (take_image satellite4 planet21 instrument10 image3)
   added: (have_image planet21 image3)
   goals met: 4 of 23
13. (turn_to satellite4 planet24 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet24)
   goals met: 4 of 23
14. (take_image satellite4 planet24 instrument10 image1)
   added: (have_image planet24 image1)
   goals met: 5 of 23
15. (turn_to satellite4 planet25 planet24)
   deleted: (pointing satellite4 planet24)
   added: (pointing satellite4 planet25)
   goals met: 5 of 23
16. (take_image satellite4 planet25 instrument10 image3)
   added: (have_image planet25 image3)
   goals met: 6 of 23
17. (turn_to satellite4 star19 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 star19)
   goals met: 6 of 23
18. (take_image satellite4 star19 instrument10 image3)
   added: (have_image star19 image3)
   goals met: 7 of 23
19. (turn_to satellite4 star5 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star5)
   goals met: 7 of 23
20. (take_image satellite4 star5 instrument10 image1)
   added: (have_image star5 image1)
   goals met: 8 of 23
21. (turn_to satellite3 planet21 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet21)
   goals met: 9 of 23
22. (turn_to satellite0 groundstation3 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 groundstation3)
   goals met: 9 of 23
23. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 9 of 23
24. (turn_to satellite0 phenomenon15 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon15)
   goals met: 9 of 23
25. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 10 of 23
26. (turn_to satellite0 planet11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet11)
   goals met: 10 of 23
27. (take_image satellite0 planet11 instrument0 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 11 of 23
28. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 11 of 23
29. (take_image satellite0 planet14 instrument0 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 12 of 23
30. (turn_to satellite0 planet20 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet20)
   goals met: 12 of 23
31. (take_image satellite0 planet20 instrument0 thermograph0)
   added: (have_image planet20 thermograph0)
   goals met: 13 of 23
32. (turn_to satellite0 planet22 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet22)
   goals met: 13 of 23
33. (take_image satellite0 planet22 instrument0 spectrograph4)
   added: (have_image planet22 spectrograph4)
   goals met: 14 of 23
34. (turn_to satellite0 planet23 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 planet23)
   goals met: 14 of 23
35. (take_image satellite0 planet23 instrument0 thermograph0)
   added: (have_image planet23 thermograph0)
   goals met: 15 of 23
36. (turn_to satellite0 planet6 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 planet6)
   goals met: 15 of 23
37. (take_image satellite0 planet6 instrument0 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 16 of 23
38. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 16 of 23
39. (take_image satellite0 planet9 instrument0 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 17 of 23
40. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   goals met: 18 of 23
41. (turn_to satellite0 star10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star10)
   goals met: 17 of 23
42. (take_image satellite0 star10 instrument0 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 18 of 23
43. (turn_to satellite0 star0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star0)
   goals met: 19 of 23
44. (turn_to satellite0 star18 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star18)
   goals met: 18 of 23
45. (take_image satellite0 star18 instrument0 spectrograph4)
   added: (have_image star18 spectrograph4)
   goals met: 19 of 23
46. (turn_to satellite0 star0 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star0)
   goals met: 20 of 23
47. (turn_to satellite0 star26 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star26)
   goals met: 19 of 23
48. (take_image satellite0 star26 instrument0 thermograph0)
   added: (have_image star26 thermograph0)
   goals met: 20 of 23
49. (turn_to satellite0 star0 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star0)
   goals met: 21 of 23
50. (turn_to satellite0 star27 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star27)
   goals met: 20 of 23
51. (take_image satellite0 star27 instrument0 thermograph0)
   added: (have_image star27 thermograph0)
   goals met: 21 of 23
52. (turn_to satellite0 star0 star27)
   deleted: (pointing satellite0 star27)
   added: (pointing satellite0 star0)
   goals met: 22 of 23
53. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   goals met: 21 of 23
54. (take_image satellite0 star8 instrument0 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 22 of 23
55. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   goals met: 23 of 23
